Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/adoption_and_fostering/tracing_your_birth_family.html.txt.tmx
Source language: en
Languages: ga

source: Tracing your birth family
ga: Do theaghlach breithe a lorg

source: Tracing your birth family if you were adopted or fostered in Ireland can be a difficult and sometimes painful process, and it can be hard to know where to start looking
ga: Próiseas atá i do theaghlach breithe a rianú a d’fhéadfadh bheith deacair agus pianmhar, amanna, má uchtaíodh thú nó má altramaíodh thú in Éirinn, agus d’fhéadfadh sé bheith deacair fios a bheith agat cár cheart duit tús a chur le cuardach a dhéanamh

source: The process can be similarly difficult and emotional for a birth mother or father tracing an adopted child
ga: D’fhéadfadh an próiseas a bheith chomh deacair agus chomh mothúchánach céanna ar mháthair nó athair breithe a mbíonn leanbh uchtaithe á rianú acu

source: However, there are specific channels you can use to try and find your family or child, and there are a lot of support organisations that can give you practical advice and counselling throughout the process
ga: Tá bealaí ar leith ann, áfach, is féidir leat a úsáid chun iarracht a dhéanamh chun do theaghlach nó do leanbh a aimsiú, agus tá go leor eagraíochtaí tacaíochta ann ar féidir leo comhairle agus comhairleoireacht phraiticiúil a thabhairt duit i gcaitheamh an phróisis

source: The same channels and supports are also available to other members of an adopted child's birth family
ga: Tá na bealaí agus na tacaíochtaí céanna ar fáil do gach duine muinteartha de theaghlach breithe linbh uchtaithe

source: There is no central location for adoption files in this country, so you may have to apply to a few different organisations to get the information you are looking for
ga: Níl aon láthair lárnach ann do chomhaid uchtála sa tír seo, mar sin, b’fhéidir go mbeidh ort iarratas a dhéanamh ar roinnt eagraíochtaí éagsúla chun an fhaisnéis a fháil atá á cuardach agat

source: Your first step should be to contact the adoption agency responsible for your placement or the placement of your child
ga: Ba cheart go ndéanfá teagmháil leis an ngníomhaireacht uchtála, ar dtús, atá freagrach as tú féin a chur i gcúram altrama/uchtála nó do leanbh a chur i gcúram altrama/uchtála

source: This will either be a registered adoption society or the Health Service Executive (HSE)
ga: Cumann cláraithe uchtála nó Feidhmeannacht na Seirbhíse Sláinte (FSS) a bheidh i gceist leo seo

source: In 2005 all 'health boards' in Ireland were replaced by the Health Service Executive (HSE)
ga: In 2005, cuireadh Feidhmeannacht na Seirbhíse Sláinte (FSS) in ionad gach ‘boird sláinte’ in Éirinn

source: The HSE still holds 'health board' records
ga: Tá taifid ‘bhord sláinte’ fós á gcoimeád ag FSS

source: (In the past, adoptions were handled by health boards)
ga: (Roimhe seo, láimhseáil na boird sláinte uchtáil)

source: The adoption agency should have a file on the adoption that may contain some information on your origins or where your child was placed
ga: Ba cheart go mbeadh comhad ag an ngníomhaireacht uchtála ar an uchtáil ina bhféadfadh roinnt faisnéise bheith ar fáil ar do bhunús nó ar cén áit ar cuireadh do leanbh i gcúram altrama/uchtála

source: If you do not have or cannot remember the name of the agency, you should write to the Adoption Authority
ga: Mura bhfuil ainm na gníomhaireachta agat nó mura gcuimhníonn tú air, ba cheart duit scríobh chuig an Údarás Uchtála

source: The Authority is an independent statutory body that can grant or refuse applications for adoption orders in relation to Irish adoption
ga: Comhlacht neamhspleách reachtúil atá san Údarás ar féidir leis iarratais ar orduithe uchtála a dheonú nó a dhiúltú maidir le huchtáil Éireannach

source: The Authority is also responsible for registering and supervising adoption agencies and societies in Ireland
ga: Tá an tÚdarás, freagrach, chomh maith, as gníomhaireachtaí agus cumainn uchtála in Éirinn a chlárú agus a mhaoirsiú

source: If you are an adopted person, in your letter you should include your name, date of birth, the names of your adoptive parents and your address at the time of your placement
ga: Más duine uchtaithe thú, ba cheart duit d’ainm, dáta breithe, ainmneacha do thuismitheoirí uchtála agus an seoladh a bhí agat ag tráth do chuir i gcúram altrama/uchtála a chur san áireamh i do litir

source: The Authority has details of all registered adoptions dating from 1952 and should be able to give you the name of the agency that dealt with your case
ga: Tá sonraí ag an Údarás ar gach uchtáil chláraithe ó 1952 i leith agus ba cheart go mbeidís in ann ainm na gníomhaireachta a thabhairt duit a dhéileáil le do chás

source: When you have approached an adoption society or your Local Health Office in the HSE about finding your birth family or child, you will be asked to fill out a form giving some basic details about yourself
ga: Tá liostaí fada feithimh ag an gcuid is mó de na gníomhaireachtaí de dhaoine a bhfuil iarrachtaí á ndéanamh acu chun a dteaghlaigh bhreithe a aimsiú, mar sin, tá ort foighne a bheith agat

source: Most agencies have long waiting lists of people trying to trace their birth families so you may have to be patient
ga: Nuair a thagann do bhabhta aníos, déanfaidh oibrí sóisialta ón ngníomhaireacht teagmháil leat agus iarrfar ort teacht isteach le haghaidh cruinniú

source: When your turn comes, you will be contacted by a social worker from the agency and asked to come in for a meeting
ga: Ar do chéad chuairt, ba cheart duit fiafraí faoi bheartas na gníomhaireachta maidir le cuardach a dhéanamh ar theaghlaigh bhreithe nó ar leanaí uchtaithe

source: On your first visit, you should ask about the agency's policy in relation to searching for birth families or adopted children
ga: Ba cheart duit a dheimhniú cé chomh fada a ghlacfaidh cuardach a dhéanamh agus cén saghas tacaíochta a chuirfidh an ghníomhaireacht ar fáil duit

source: You should find out how long a search will take and what kind of support the agency will offer you
ga: Níor cheart duit bheith ag súil leis go soláthrófar an-chuid faisnéise duit i dtosach báire

source: You should not expect a lot of information to begin with
ga: Go ginearálta, ní thabharfaidh na gníomhaireachtaí duit ach é sin ar a

source: Generally, the agencies will only give out what they call non-identifying information (no full names or addresses), unless the consent of all parties has been obtained
ga: dtugtar faisnéis neamhaitheantais (ní thabharfaidh siad ainmneacha nó seoltaí iomlána), murach go bhfuarthas toiliú na bpáirtithe go léir

source: If the adoption society that dealt with your case has closed since your placement, your records will have been transferred to the HSE
ga: Má dúnadh an cumann uchtála a dhéileáil le do chás ó rinneadh thú a chur i gcúram altrama/uchtála, beidh do thaifid aistrithe chuig FSS

source: If this is the case, you should follow the same procedure that you would use for the adoption society
ga: Más amhlaidh an cás, ba cheart duit an nós imeachta céanna a leanúint a d’úsáidfeá don chumann uchtála

source: That is, tell your Local Health Office in the HSE that you are trying to trace your birth family or child
ga: Is é sin, déan teagmháil le d’Oifig Sláinte Áitiúil in FSS agus cuir ar an eolas iad go bhfuil iarracht á déanamh agat do theaghlach breithe nó do leanbh á rianú agat

source: It is possible to trace your birth family or child on your own or with the help of a private detective and some people decide to pursue this option
ga: Is féidir leat do theaghlach breithe nó do leanbh a rianú tú féin le cabhair nó gan cabhair ó bhleachtaire príobháideach agus déanann roinnt daoine an cinneadh chun dul i muinín na rogha seo

source: However, the adoption authorities do not advise this
ga: Ní mholann na húdaráis uchtála dul i muinín na rogha seo, áfach

source: They recommend that any searches are carried out in a controlled way to ensure that neither party is forced into something they are unwilling or unable to cope with
ga: Molann siad go dtugtar faoi chuardaigh ar bhealach rialaithe lena chinntiú nach gcuirtear brú ar cheachtar páirtí rud éigin a dhéanamh nach bhfuil siad toiliúil a dhéanamh nó nach bhfuil siad in ann déileáil leis

source: If you are adopted, it means that your birth family lose all legal rights over you, and your welfare is no longer their responsibility
ga: Má tá tú uchtaithe, ciallaíonn sé go gcailleann do theaghlach breithe gach ceart dlíthiúil ort, agus nach bhfuil siad freagrach a thuilleadh as do leas

source: This responsibility passes onto your adoptive family
ga: Aistrítear an fhreagracht seo chuig do theaghlach uchtála

source: Your adoptive name is entered into the Adopted Children Register and a certified copy of the entry in the Adopted Children Register is issued for you
ga: Iontráiltear d’ainm uchtála isteach i gClár na Leanaí Uchtaithe agus eisítear cóip dheimhnithe den iontráil i gClár na Leanaí Uchtaithe duit

source: Only registered adoption societies and the HSE are legally allowed to place children up for adoption
ga: Ní cheadaítear go dlíthiúil ach do chumainn chláraithe uchtála agus do FSS leanaí a chur i gcúram uchtála

source: In May 2005 the Adoption Board (now called the Adoption Authority) launched a National Adoption Contact Preference Register
ga: An 3 Bealtaine 2005, sheol an Bord Uchtála (ar a dtugtar anois an tÚdarás Uchtála) Clár um Rogha Teagmhála Náisiúnta Uchtála

source: The purpose of the Register is to facilitate contact between adopted people and their birth families
ga: Is é cuspóir an Chláir chun teagmháil idir daoine uchtaithe agus a dteaghlaigh bhreithe a éascú

source: Participation is voluntary and contact through the register is only initiated where both parties register
ga: Tá rannpháirtíocht deonach agus ní chuirfear tús le teagmháil tríd an gclár ach nuair a chláraíonn an dá pháirtí

source: The Register allows you to choose what level of contact you wish to have
ga: Ligeann an Clár duit a roghnú cén leibhéal teagmhála is mian leat a bheith agat

source: There is further information on the National Adoption Contact Preference Register on the Adoption Authority's website
ga: Tá breis faisnéise ar an gClár um Rogha Teagmhála Náisiúnta Uchtála ar láithreán gréasáin an Údaráis Uchtála

source: You may have been placed with a long-term foster family because, for various reasons, you could not live with your own family
ga: B’fhéidir gur cuireadh thú i gcúram teaghlach fadtéarmach altrama mar gheall, ar chúiseanna éagsúla, nach raibh tú in ann cónaí le do theaghlach féin

source: However, foster children are legally still part of their own family and the HSE is responsible for you while you are in foster care
ga: Tá leanaí altrama fós mar chuid dá dteaghlach féin, i dtaobh cúrsaí dlíthiúla, áfach, agus tá FSS freagrach astu fad a bhíonn siad i gcúram altrama

source: It should have details of your placement and your own family
ga: Ba cheart go mbeadh sonraí acu faoi do chur i gcúram altrama agus do theaghlach féin

source: If you were fostered a number of years ago, it is possible that records are not of the same standard that is required today
ga: Má cuireadh i gcúram altrama thú roinnt blianta ó shin, d’fhéadfadh nach bhfuil na taifid ar an gcaighdeán céanna a theastaíonn inniu

source: Also, if your own family lost contact with you, your foster family or the HSE, tracing your family after a number of years may be a difficult task
ga: Anuas air sin, murar lean do theaghlach féin le teagmháil a dhéanamh leat féin, le do theaghlach altrama nó le FSS, d’fhéadfadh go mbeadh sé deacair do theaghlach a rianú i ndiaidh roinnt blianta

source: If you were not legally adopted, the Adoption Authority recommends that you apply to the Local Health Office in the HSE in the region where you lived as a child
ga: Mura ndearnadh thú a uchtáil go dlíthiúil, molann an tÚdarás Uchtála go ndéanann tú iarratas ar an Oifig Sláinte Áitiúil in FSS sa réigiún inar chónaigh tú agus tú i do leanbh

source: It may be able to help you trace your birth family as it is very likely that it was involved in or had some knowledge of your placement
ga: D’fhéadfadh sé cabhrú leat do theaghlach breithe a rianú mar gheall gur rí-dhóchúil go raibh baint acu le thú a chur i gcúram uchtála nó go raibh roinnt eolais acu air

source: You may still have your original birth certificate, giving details of where you were born
ga: D’fhéadfadh go bhfuil do bhunteastas breithe agat, a thugann sonraí faoin áit ar rugadh thú

source: This may also be of help as some hospitals may keep records from the period of your birth
ga: D’fhéadfadh seo roinnt cabhrach a thabhairt duit, chomh maith, mar gheall go gcoimeádann roinnt ospidéal taifid ó thréimhse do bhreithe

source: For more information on trying to trace your birth family if you were never legally adopted or if you are the birth parent of an illegally adopted child, you can contact the Adoption Authority or some of the adoption support organisations listed below
ga: Chun teacht ar bhreis faisnéise chun iarracht a dhéanamh do theaghlach breithe a rianú mura ndearnadh thú a uchtáil go dlíthiúil riamh nó más tú féin tuismitheoir breithe linbh a uchtaíodh go neamhdhlíthiúil, féadfaidh tú teagmháil a dhéanamh leis an Údarás Uchtála nó le cuid de na heagraíochtaí tacaíochta uchtála a liostaítear thíos

source: Tracing your birth father
ga: D’athair breithe a rianú

source: If you decide to trace your birth father, you will generally have to contact your birth mother first
ga: Má dhéanann tú an cinneadh chun d’athair breithe a rianú, is gnách go mbeidh ort teagmháil a dhéanamh le do mháthair bhreithe ar dtús

source: The birth father's name is frequently not listed on a birth certificate and your birth mother will be the only person who can identify him
ga: Is minic nach liostaítear ainm an athar breithe ar theastas breithe agus is í do mháthair bhreithe an t-aon duine a bheidh in ann é a shainaithint

source: If his name is listed on the birth certificate, you should contact the Adoption Authority or adoption agency that dealt with your case to get advice on how to proceed
ga: Má tá a ainm liostaithe ar an teastas breithe, ba cheart duit teagmháil a dhéanamh leis an Údarás Uchtála nó le gníomhaireacht uchtála a dhéileáil le do chás chun comhairle a fháil faoi conas leanúint ar aghaidh

source: It is not recommended that you contact your birth family without outside help and counselling from professionals
ga: Ní mholtar go ndéanann tú teagmháil le do theaghlach breithe gan cabhair sheachtrach agus comhairleoireacht a fháil ó ghairmithe

source: This would also apply to a birth father trying to trace his adopted child
ga: Bhainfeadh seo le hathair breithe, chomh maith, a mbeadh iarrachtaí á dhéanamh aige a leanbh uchtaithe a rianú

source: Great care needs to be taken to ensure that the child (and the adopted parents, if appropriate) are prepared and willing to meet the birth father
ga: Is gá bheith an-chúram go deo lena chinntiú go bhfuil an leanbh (agus na tuismitheoirí uchtála, más cuí) réidh agus toiliúil le casadh leis an athair breithe

source: If you would like more information about tracing your natural child, you should contact the adoption society or the HSE Local Health Office that arranged the placement
ga: Más mian leat breis faisnéise a fháil faoi do leanbh nádúrtha a rianú, ba cheart duit teagmháil a dhéanamh leis an gcumann

source: If you do not have this information, the Adoption Authority will be able to help
ga: uchtála nó leis an Oifig Sláinte Áitiúil de chuid FSS a shocraigh an cur i gcúram

source: Any change you want to
ga: Mura bhfuil an fhaisnéis seo agat, beidh an tÚdarás Uchtála in ann cabhrú leat

source: make to your legal name (for example if you want to take the name of your birth father or mother) will have to be done by deed poll
ga: Beidh aon athrú is mian leat a dhéanamh ar d’ainm dlíthiúil (mar shampla más mian leat glacadh le hainm d’athar nó do mháthar breithe) a dhéanamh trí vótáil ghníomhais

source: Tracing your birth family or adopted child is not something you should undertake lightly and you should be prepared for the emotions that this process could bring to the surface
ga: Ní gníomh é do theaghlach breithe nó do leanbh uchtaithe a rianú a dtugann tú faoi gan mórán machnaimh a dhéanamh i dtosach air, agus ba cheart duit bheith ar an airdeall ar na mothúcháin a d’fhéadfadh an próiseas seo a spreagadh

source: Most adoption societies and the HSE offer counselling to people trying to trace their birth family and it is recommended that you talk to a social worker or counsellor before and during the process
ga: Cuireann an chuid is mó de na cumainn uchtála agus FSS comhairleoireacht ar tairiscint dóibh siúd a bhfuil iarracht á déanamh acu a dteaghlach breithe a rianú agus moltar go labhraíonn tú le hoibrí sóisialta nó le comhairleoir roimh an bpróiseas agus lena linn

source: There are many support and self-help groups for people who have been adopted or who have placed children for adoption
ga: Tá go leor grúpaí tacaíochta agus féinchabhrach an do dhaoine a uchtaíodh nó a chur leanaí i gcúram uchtála

source: They provide a lot of information and advice from people who have already gone through a similar experience
ga: Cuireann siad go leor faisnéise agus comhairle ar fáil ó dhaoine a raibh a chomhionann d’eispéireas acu cheana féin

source: Organisations that offer support are listed below
ga: Liostaítear thíos eagraíochtaí a chuireann tacaíocht ar fáil thíos

source: Outcomes from tracing attempts
ga: Torthaí ó iarrachtaí rianaithe

source: There are a number of possible outcomes to any attempt to trace your birth family
ga: Tá roinnt torthaí féideartha ann ar aon iarracht chun do theaghlach breithe a rianú

source: You may find the birth mother/father or adopted child you were looking for and reunite with them
ga: D’fhéadfá an mháthair/an t-athair breithe nó an leanbh uchtaithe a aimsiú a bhí á c(h)uardach agat agus athaontú a dhéanamh leo

source: On the other hand, you may find them and discover that they do not want to meet you
ga: Ar an taobh eile den phingin, d’fhéadfá iad a aimsiú agus a fháil amach nár mhaith leo casadh leat

source: They may have died before you found them or got a chance to meet them
ga: D’fhéadfadh go bhfuair siad bás sular aimsigh tú iad nó go raibh an deis agat casadh leo

source: Another possibility is that you may never find the person you are looking for
ga: B’éard a d’fhéadfadh tarlú, chomh maith, ná nach n-éiríonn leat riamh an duine a aimsiú atá á chuardach agat

source: This is more likely if you are dealing with records from the 1930s, 1940s, 1950s or 1960s as those records generally contain very little information
ga: Is dóchúla go dtarlóidh seo má tá tú ag déileáil le taifid ó na 1930idí, 1940idí, 1950idí nó na 1960idí mar gheall go gcuimsítear fíor-bheagán faisnéise sna taifid siúd

source: All of these outcomes can bring their own problems and emotional concerns
ga: Féadfaidh na torthaí go léir seo a bhfadhbanna agus a mbuarthaí mothúchánacha féin a chruthú

source: Talking to professional counsellors or other people who have been through similar experiences can be a great help in coming to terms with your feelings at this time
ga: Féadann labhairt le comhairleoirí gairmiúla nó le daoine eile a ghabh trína shamhail d’eispéireas lámh mhór chúnta a thabhairt duit chun déileáil le do chuid mothúchán ag an tráth seo

source: If you have successfully located your birth family or child, and everyone has agreed to a meeting, the next step is to arrange a time and place
ga: Má d’éirigh leat do theaghlach breithe nó do leanbh a aimsiú, agus má chomhaontaigh gach duine chun casadh le chéile, is é an chéad chéim eile ná chun am agus áit a shocrú

source: It is recommended that your social worker act as a liaison between you and your birth mother, for example
ga: Moltar go ngníomhaíonn d’oibrí sóisialta mar idirchaidreamh idir tú féin agus do mháthair bhreithe, mar shampla

source: It can help to have a neutral third party there to make the introductions and ease the tension
ga: Féadfaidh sé bheith cabhrach chun tríú páirtí neodrach a bheith ann chun sibh a chur in aithne agus chun an teannas a mhaolú

source: Your meeting place should be private and the first meeting should last for a relatively short time, for example, two hours
ga: Ba cheart go mbeadh an áit a gcasann sibh príobháideach agus níor cheart don chéad chasadh le chéile maireachtáil ró-fhada, mar shampla, dhá uair an chloig

source: It may be helpful to have exchanged letters, photos or details of your lives before the meeting
ga: D’fhéadfadh sé bheith cabhrach litreacha, grianghraif nó sonraí faoi bhur saol roimh an gcasadh le chéile a bheith seolta eadraibh

source: You should talk to your social worker about this
ga: Ba cheart duit labhairt le d’oibrí sóisialta faoi seo

source: You should not expect too much from a first meeting
ga: Níor cheart duit bheith ag súil leis an iomarca ón gcéad chasadh le chéile

source: It can be difficult for everyone involved and will not necessarily dictate the way your relationship will develop in the future
ga: D’fhéadfadh sé bheith deacair ar gach duine atá i gceist agus ní hé go stiúrfaidh sé an bealach a fhorbróidh bhur gcaidreamh amach anseo

source: Not every reunion will result in a relationship and, for some people, an initial meeting is all they want
ga: Ní eascróidh caidreamh as gach athaontú agus, i gcás roinnt daoine, ní theastaíonn uathu ach casadh le chéile i dtosach

source: Other people will be anxious to develop a relationship with the person with whom they have been reunited
ga: Beidh daoine eile meáite ar chaidreamh a fhorbairt leis an duine a ndearna siad athaontú leo

source: This may be a rewarding experience but it could also be one with many difficulties
ga: D’fhéadfadh seo bheith ina eispéireas fiúntach ach d’fhéadfadh go leor deacrachtaí bheith i gceist leis, chomh maith

source: You should be prepared to deal with the intense emotions you may experience and make sure your adoptive or foster family members understand what you are going through
ga: Ba cheart duit bheith ullamh chun déileáil leis na mothúcháin thréana a bhféadfá bheith thíos leo agus cinntiú go dtuigeann daoine muinteartha do theaghlaigh uchtála nó altrama an méid a bhfuil tú ag déileáil leis

source: They can be a source of great support to you but it may be difficult for them to enter into your feelings completely
ga: D’fhéadfaidís bheith mar fhoinse de thacaíocht mhór duit ach d’fhéadfadh gur tráth casta é dóibh chun déileáil go hiomlán le do mhothúcháin

source: Support will be available from your social worker or from the support and self-help groups listed below
ga: Cuirfidh d’oibrí sóisialta tacaíocht ar fáil duit nó cuirfear tacaíocht ar fáil duit ó na grúpaí tacaíochta agus féinchabhrach a liostaítear thíos

source: The legislation that applies to the tracing of birth families is the Adoption Act 2010
ga: Is é an tAcht Uchtála, 2010 an reachtaíocht a bhaineann le teaghlaigh bhreithe a rianú

source: The Act does not specifically state that adopted people should have automatic access to their birth certificates
ga: Ní luaitear go sonrach san Acht gur cheart go mbeadh rochtain uathoibríoch ag daoine ar a dteastais bhreithe

source: However, under Part 10 of the legislation, the Registrar General must keep a record of all adoptions
ga: Ach faoi Chuid 10 den reachtaíocht, áfach, ní mór don Ard-Chláraitheoir cuntas a choimeád ar gach uchtáil

source: This is known as the "Adopted Children Register" and it is available to members of the public for inspection
ga: Tugtar “Clár na Leanaí Uchtaithe” air seo agus tá sé ar fáil do mhuintir an phobail lena iniúchadh
